<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Untitled Document</title>
<style type="text/css">
<!--
.style1 {color: #CC0000}
.style2 {color: #003399}
.style3 {color: #000000}
-->
</style>
<script language="JavaScript" type="text/JavaScript">
<!--
function MM_reloadPage(init) {  //reloads the window if Nav4 resized
  if (init==true) with (navigator) {if ((appName=="Netscape")&&(parseInt(appVersion)==4)) {
    document.MM_pgW=innerWidth; document.MM_pgH=innerHeight; onresize=MM_reloadPage; }}
  else if (innerWidth!=document.MM_pgW || innerHeight!=document.MM_pgH) location.reload();
}
MM_reloadPage(true);
//-->
</script>
</head>

<body>
<div id="Layer1" style="position:absolute; left:31px; top:89px; width:309px; height:83px; z-index:1">
  <embed src="file:///C|/Users/Sergio/Downloads/Qu&#233;%20es%20software%20y%20qu&#233;%20es%20hardware%20_%20Computaci&#243;n%20y%20programaci&#243;n.mp4" width="308" height="83"></embed>
</div>
<h1 align="center" class="style2">Hardware y software</h1>
<p align="center" class="style2">
  <embed src="../Videos/QUE%20ES%20EL%20SOFTWARE.mp4" width="363" height="115"></embed>
</p>
<p align="center" class="style2">&nbsp;</p>
<p class="style2">&nbsp;</p>
<h2>&iquest;Qu&eacute; es un hardware?</h2>
<p>El hardware es&nbsp;<strong>toda la parte f&iacute;sica de una computadora</strong>, todo lo que puedes ver y tocar.</p>
<p>En general, se los divide en dos grupos:</p>
<ul>
  <li><strong>Hardware b&aacute;sico</strong>: se trata de todos los elementos fundamentales e indispensables para el funcionamiento de la m&aacute;quina, como el disco duro o la memoria RAM, por ejemplo;</li>
  <li><strong>Hardware complementario</strong>: seg&uacute;n sugiere el nombre, el hardware complementario agrupa los elementos que no son esenciales para el funcionamiento del equipo y que realizan tareas adicionales espec&iacute;ficas, como impresoras y pendrives, por ejemplo.</li>
</ul>
<h2>&iquest;Qu&eacute; es un software?</h2>
<p>Hardware y software son inseparables y complementarios, dos caras de una misma moneda. El hardware es como un cuerpo vac&iacute;o, inanimado. El software es lo que&nbsp;<strong>posibilita la comunicaci&oacute;n entre el equipo y el usuario</strong>.</p>
<p><strong>Toda la parte&nbsp;</strong><a rel="noreferrer noopener" href="https://rockcontent.com/es/blog/transformacion-digital/" target="_blank"><strong>digital</strong></a><strong>,&nbsp;</strong>es decir los comandos e instrucciones que son procesados por la computadora, es lo que llamamos de software. Se los divide en:</p>
<ul>
  <li><strong>Software de sistema:</strong>&nbsp;incluye el sistema operativo, los controladores de dispositivo y los utilitarios de sistema;</li>
  <li><strong>Software de aplicaci&oacute;n:&nbsp;</strong>son los programas que utilizas para realizar determinada tarea, como por ejemplo, los procesadores de texto o las&nbsp;<a href="https://rockcontent.com/es/blog/como-crear-una-app/" target="_blank" rel="noreferrer noopener" aria-label="aplicaciones (abre numa nova aba)">aplicaciones</a>;</li>
  <li><strong>Software de programaci&oacute;n:</strong>&nbsp;herramientas digitales que sirven para la creaci&oacute;n de nuevos programas, o para el desarrollo de programas ya existentes.</li>
</ul>
<h2>&iquest;Qu&eacute; ejemplos de hardware y software existen?</h2>
<p>Para que entiendas mejor lo que hemos visto hasta aqu&iacute;, veamos algunos ejemplos de hardware y software a continuaci&oacute;n:</p>
<h3>Ejemplos de hardware</h3>
<ol>
  <li><strong>CPU:&nbsp;</strong>responsable por procesar toda la informaci&oacute;n que ingresa al equipo;</li>
  <li><strong>Teclado:</strong>&nbsp;permite introducir informaci&oacute;n a la m&aacute;quina y coordinar su funcionamiento;</li>
  <li><strong>Impresora:</strong>&nbsp;es un hardware perif&eacute;rico que recibe informaci&oacute;n de la computadora y con base en esas informaciones realiza determinada tarea.</li>
</ol>
<h3>Ejemplos de software</h3>
<ol>
  <li><strong>Windows:&nbsp;</strong>es el sistema operativo de Microsoft;</li>
  <li><strong>Mozilla Firefox:</strong>&nbsp;es un navegador, permite al usuario acceder a los sitios web, realizar descargas, etc;</li>
  <li><strong>Adobe Photoshop:&nbsp;</strong>es uno de los programas de edici&oacute;n de im&aacute;genes m&aacute;s utilizados en todo el mundo.</li>
</ol>
</body>
</html>
